### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be created
  + resource "azurerm_kubernetes_cluster" "aks" {
      + current_kubernetes_version          = (known after apply)
      + dns_prefix_private_cluster          = "faspo-poc-aks-dns"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "germanywestcentral"
      + name                                = "faspo-poc-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "faspo-poc-aks-nodes-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = true
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateDnsZones/privatelink.germanywestcentral.azmk8s.io"
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "faspo-poc-comp-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = true

      + auto_scaler_profile (known after apply)

      + default_node_pool {
          + auto_scaling_enabled = true
          + kubelet_disk_type    = (known after apply)
          + max_count            = 10
          + max_pods             = (known after apply)
          + min_count            = 2
          + name                 = "default"
          + node_count           = (known after apply)
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = "Ubuntu"
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_DS2_v2"
          + vnet_subnet_id       = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet/subnets/faspo-poc-vnet-infra-subnet"
          + workload_runtime     = (known after apply)
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-aks-uami",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + kubelet_identity {
          + client_id                 = "80420d0c-af19-40de-8cb1-e9d632fc7eea"
          + object_id                 = "6ee38f36-246d-4257-9c52-66bc02f84a82"
          + user_assigned_identity_id = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-sec-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/faspo-poc-aks-uami"
        }

      + network_profile {
          + dns_service_ip     = "10.0.3.254"
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = "calico"
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = "10.0.3.0/24"
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # azurerm_private_endpoint.aks-pen will be created
  + resource "azurerm_private_endpoint" "aks-pen" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "faspo-poc-aks-pen-nic"
      + id                            = (known after apply)
      + location                      = "germanywestcentral"
      + name                          = "faspo-poc-aks-pen"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "faspo-poc-net-rg"
      + subnet_id                     = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet/subnets/faspo-poc-vnet-infra-subnet"

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "faspo-poc-aks-pen-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/privateDnsZones/privatelink.germanywestcentral.azmk8s.io",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "aks-pen-connection"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "management",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
